Revit 2024 API
ViewSchedule.BodyTextTypeId Property
 Defines the default text style used for the data section of the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId BodyTextTypeId { get; set; }
Visual Basic
Public Property BodyTextTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BodyTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Columns may override the default style.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The text type id doesn't represent a valid text type element.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace